In [2]:
import pandas as pd
import numpy as np

In [ ]:
# DataFrame.map(func, na_action=None, **kwargs)
# Apply a function to a Dataframe elementwise.

func : callable
Python function, returns a single value from a single value.

na_action : {None, ‘ignore’}, default None
If ‘ignore’, propagate NaN values, without passing them to func.

**kwargs
Additional keyword arguments to pass as keywords arguments to func.

In [3]:
df = pd.DataFrame([[1, 2.12], [3.356, 4.567]])
df

       0      1
0  1.000  2.120
1  3.356  4.567

In [4]:
df.map(lambda x: len(str(x)))

   0  1
0  3  4
1  5  5

In [5]:
df_copy = df.copy()
df_copy.iloc[0, 0] = pd.NA
df_copy

       0      1
0    NaN  2.120
1  3.356  4.567

In [6]:
df_copy.map(lambda x: len(str(x)), na_action='ignore')

     0  1
0  NaN  4
1  5.0  5

In [7]:
df.map(round, ndigits=1)

     0    1
0  1.0  2.1
1  3.4  4.6

In [8]:
df.map(lambda x: x**2)

           0          1
0   1.000000   4.494400
1  11.262736  20.857489